---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkOptions.Dispose
source: html/3c90d55b-be33-3aad-a01c-3dc71407218f.htm
---
# Autodesk.Revit.DB.RevitLinkOptions.Dispose Method

Releases all resources used by the RevitLinkOptions

## Syntax (C#)
```csharp
public void Dispose()
```